app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        @schoolclass = SchoolClass.find(params[:id])

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdf"], ["room_number", 0], ["created_at", "2021-05-01 17:30:16.378564"], ["updated_at", "2021-05-01 17:30:16.378564"]]
---
    def create
        @schoolclass = SchoolClass.new(schoolclass_params)
        @schoolclass.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @schoolclass = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 0], ["updated_at", "2021-05-01 18:50:15.812731"], ["id", 5]]
---
    def update
        @schoolclass = SchoolClass.find(params[:id])
        @schoolclass.update(schoolclass_params)