app/controllers/students_controller.rb

    def create
        @student = Student.new(student_params)
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "aasdfasd"], ["last_name", "a"], ["created_at", "2021-05-01 17:49:37.799079"], ["updated_at", "2021-05-01 17:49:37.799079"]]